admbase/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтола</name>
    <type>
      <types>EnumRef.ВидыСтолов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаДляРецептов</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияМеню</name>
    <type>
      <types>CatalogRef.КатегорииМеню</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоБлюд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДляМеню</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляРецептов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитЕдиницХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеБлюда</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставНабора</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>кКал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

admbase/src/Catalogs/Номенклатура/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВидНоменклатуры") Тогда
		
		ОтборПоВиду = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоВиду.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидНоменклатуры");
		ОтборПоВиду.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборПоВиду.ПравоеЗначение = Параметры.ВидНоменклатуры; 
		
	КонецЕсли;
	
	Если Параметры.Свойство("СоставМеню") Тогда
	
		ОтборПоВиду = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоВиду.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидНоменклатуры");
		ОтборПоВиду.ВидСравнения 	= ВидСравненияКомпоновкиДанных.ВСписке;
		ОтборПоВиду.ПравоеЗначение 	= Параметры.СоставМеню; 
	
	КонецЕсли;
	
	Если Параметры.Свойство("ДляМеню") Тогда
	
		ОтборПоВиду = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоВиду.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДляМеню");
		ОтборПоВиду.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
		ОтборПоВиду.ПравоеЗначение 	= Истина; 
	
	КонецЕсли;
	
	Если Параметры.Свойство("ДляРецептов") Тогда
	
		ОтборПоВиду = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоВиду.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДляРецептов");
		ОтборПоВиду.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
		ОтборПоВиду.ПравоеЗначение 	= Истина; 
	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
